'''
11. Дано три змінні: X, Y, Z. Якщо їх значення впорядковані за спаданням, то подвоїти їх; в іншому
випадку замінити значення кожної змінної на протилежне.
'''


def check(a, b, c):
    if a > b and b > c:
        a, b, c = a * 2, b * 2, c * 2
    else:
        a, b, c = -a, -b, -c
    return a, b, c


x = int(input('Введіть число X'))
y = int(input('Введіть число Y'))
z = int(input('Введіть число Z'))
x, y, z = check(x, y, z)
print(x, y, z)
